ИС_СПОРТ_2022/src/InformationRegisters/СоставыСемейСпортсменов/СоставыСемейСпортсменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставыСемейСпортсменов</name>
  <dimensions>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.РодителиЗаконныеПредставителиСпортсменов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтепеньРодства</name>
    <type>
      <types>CatalogRef.СтепениРодстваФизическихЛиц</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/InformationRegisters/СоставыСемейСпортсменов/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Спортсмен") Тогда
		Запись.Спортсмен = Параметры.Спортсмен;
		Элементы.Спортсмен.ТолькоПросмотр = Истина;
	КонецЕсли;
	Для Каждого Команда Из ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы Цикл
		Если НЕ Команда.Имя = "ФормаЗаписатьИЗакрыть"  Тогда
			Команда.Видимость = Ложь;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	НаборЗаписей = РегистрыСведений.СоставыСемейСпортсменов.СоздатьНаборЗаписей();
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.Спортсмен = Запись.Спортсмен;
	НоваяЗапись.Родитель = Запись.Родитель;
	НоваяЗапись.СтепеньРодства = Запись.СтепеньРодства;
	НаборЗаписей.Записать(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьНаСервере();
	ЭтаФорма.Модифицированность = Ложь;
	ЭтаФорма.Закрыть(Запись.Родитель);
КонецПроцедуры
